Enums/СтатусыПТУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПТУ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Составлен</Name>
					<Comment>Документ создан. В проведенном состоянии документ ожидает проведения Переоценки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПоступлению</Name>
					<Comment>Создан и проведен документ Перемещение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
					<Comment>Начата приемка товара в филиале</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОбработка</Name>
					<Comment>Ожидается обработка расхождений, выявленных при приемке товара</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бухгалтерия</Name>
					<Comment>Ожидается проверка документов Бухгалтерией</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ценообразование</Name>
					<Comment>Ожидается Переоценка по расхождениям, выявленным в результате приемки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КороректировкаОстаткаВУТ10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
					<Comment>Работа с документом завершена</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АктОРасхожденияхПослеПриемки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктОРасхожденияхПослеПриемки</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключенВСтоимость</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыАктаОРасхождениях</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВНалоговомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатурыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийАктОРасхожденияхПослеПриемки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранзитнаяПоставка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDСкладаСобственныйСклад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СобственныеСклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоДокументу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРасхождения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыДействийПоРасхождениямВАктеПослеПриемки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пересорт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Брак</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийМенеджера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийПоставщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоДокументу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасхождения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСПоДокументу</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСРасхождения</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПТУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПТУ</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладОтгрузкиПоставщику</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтгрузкаВозвратов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РазмещениеПоЯчейкам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасхожденияКМ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасхожденияКМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Недостача</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Излишек</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

WebServices/UT10_SetStatusPTU/Ext/Module.bsl
Функция ДанныеВJSONХранилище(Данные)
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	JsonСтрока = ЗаписьJSON.Закрыть(); 	
	
	ДанныеВозврат = Новый ХранилищеЗначения(JsonСтрока, Новый СжатиеДанных(9));
	
	Возврат ДанныеВозврат;
	
КонецФункции

Функция ИзменитьСтатусПТУ(ГУИДДокумента, Статус)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ИзменитьСтатусПТУ");
	
	ТекстОшибки = "";
	
	ПТУСсылка = Документы.ПоступлениеТоваровУслуг.НайтиПоРеквизиту("ИДДокументаВСмежнойБазе", ГУИДДокумента);
	
	Если ПТУСсылка.Пустая() Или ПТУСсылка.ПолучитьОбъект() = Неопределено Тогда
		
		ТекстОшибки = "В УТ10 не найден документ ПТУ по реквизиту ИД документа в смежной базе='" + ГУИДДокумента + "'";
		РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		Возврат РезультатВыполнения;

	КонецЕсли;
	
	ПТУОбъект = ПТУСсылка.ПолучитьОбъект();
	
	Если ВРЕГ(Статус) = "ЦЕНООБРАЗОВАНИЕ" Тогда
		
		Если ЗначениеЗаполнено(ПТУОбъект.Статус) и ПТУОбъект.Статус <> Перечисления.СтатусыПТУ.Бухгалтерия и ПТУОбъект.Статус <> Перечисления.СтатусыПТУ.Ценообразование Тогда
			
			ТекстОшибки = "Ошибка: для установки статуса 'Ценообразование' у документа должен быть статус 'Бухгалтерия' (" + Строка(ПТУСсылка) + ")";
			РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;

		КонецЕсли;	
		
		ПТУОбъект.Статус = Перечисления.СтатусыПТУ.Ценообразование;
		Попытка
			ПТУОбъект.Записать(?(ПТУОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		Исключение
			
			ТекстОшибки = "Ошибка при изменении статуса документа " + Строка(ПТУСсылка);
			РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;

		КонецПопытки;
		
	ИначеЕсли ВРЕГ(Статус) = "ЗАКРЫТ" Тогда
		
		Если ЗначениеЗаполнено(ПТУОбъект.Статус) и ПТУОбъект.Статус <> Перечисления.СтатусыПТУ.Ценообразование и ПТУОбъект.Статус <> Перечисления.СтатусыПТУ.Закрыт Тогда
			
			ТекстОшибки = "Ошибка: для установки статуса 'Закрыт' у документа должен быть статус 'Ценообразование' (" + Строка(ПТУСсылка) + ")";
			РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;

		КонецЕсли;	
		
		ПТУОбъект.Статус = Перечисления.СтатусыПТУ.Закрыт;
		
		Попытка
			ПТУОбъект.Записать(?(ПТУОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		Исключение
			
			ТекстОшибки = "Ошибка при изменении статуса документа " + Строка(ПТУСсылка);
			РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;
			
		КонецПопытки;

	ИначеЕсли ВРЕГ(Статус) = "БУХГАЛТЕРИЯ" Тогда
		
		Если ЗначениеЗаполнено(ПТУОбъект.Статус) и ПТУОбъект.Статус <> Перечисления.СтатусыПТУ.Ценообразование и ПТУОбъект.Статус <> Перечисления.СтатусыПТУ.Бухгалтерия Тогда
			
			ТекстОшибки = "Ошибка: для установки статуса 'Бухгалтерия' у документа должен быть статус 'Ценообразование' (" + Строка(ПТУСсылка) + ")";
			РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;

		КонецЕсли;	
		
		ПТУОбъект.Статус = Перечисления.СтатусыПТУ.Бухгалтерия;
		
		Попытка
			ПТУОбъект.Записать(?(ПТУОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		Исключение
			
			ТекстОшибки = "Ошибка при изменении статуса документа " + Строка(ПТУСсылка);
			РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;

		КонецПопытки;
	
	ИначеЕсли ВРЕГ(Статус) = "ВРАБОТЕ" Тогда
		
		Если ЗначениеЗаполнено(ПТУОбъект.Статус) и ПТУОбъект.Статус = Перечисления.СтатусыПТУ.ТребуетсяОбработка Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	АктОРасхожденияхПослеПриемки.Ссылка КАК АктОРасхождениях
			               |ИЗ
			               |	Документ.АктОРасхожденияхПослеПриемки КАК АктОРасхожденияхПослеПриемки
			               |ГДЕ
			               |	НЕ АктОРасхожденияхПослеПриемки.ПометкаУдаления
			               |	И АктОРасхожденияхПослеПриемки.ДокументОснование = &ДокументОснование";
			
			Запрос.УстановитьПараметр("ДокументОснование", ПТУОбъект.Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Отказ = Ложь;
			
			НачатьТранзакцию();			
			
			Пока Выборка.Следующий() Цикл
				
				ДокументАктОРасхождениях = Выборка.АктОРасхождениях.ПолучитьОбъект();
				ДокументАктОРасхождениях.УстановитьПометкуУдаления(Истина);
				
				Попытка
					ДокументАктОРасхождениях.Записать(РежимЗаписиДокумента.Запись);
				Исключение
					
					Отказ = Истина;
					ТекстОшибки = "Ошибка при установке пометки удаления Акта о расхождениях для ПТУ в УТ10";
					Прервать;
					
				КонецПопытки;
				
			КонецЦикла;
			
			Если Отказ Тогда
				ОтменитьТранзакцию();
			Иначе
				ЗафиксироватьТранзакцию();
			КонецЕсли;
		
		ИначеЕсли ЗначениеЗаполнено(ПТУОбъект.Статус) и ПТУОбъект.Статус <> Перечисления.СтатусыПТУ.Бухгалтерия Тогда
			
			ТекстОшибки = "Ошибка: для установки статуса 'В работе' у документа должен быть статус 'Бухгалтерия' (" + Строка(ПТУСсылка) + ")";
			РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;

		КонецЕсли;	
		
		ПТУОбъект.Статус = Перечисления.СтатусыПТУ.ВРаботе;
		
		Попытка
			ПТУОбъект.Записать(?(ПТУОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		Исключение
			
			ТекстОшибки = "Ошибка при изменении статуса документа " + Строка(ПТУСсылка);  			
			РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;

		КонецПопытки;	

	Иначе
		
		ТекстОшибки = "Передан некорректный статус для документа " + Строка(ПТУСсылка);
		РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		Возврат РезультатВыполнения;

	КонецЕсли;
	
	РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета());
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	
КонецФункции

Функция СформироватьСтруктуруОтвета(ТекстОшибки="")
	
	Ответ = Новый Структура("Результат,ТекстОшибки");
	Ответ.Результат = ?(ЗначениеЗаполнено(ТекстОшибки), Ложь, Истина);
	Ответ.ТекстОшибки = ТекстОшибки;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ЗаписьЖурналаРегистрации("Транзитные поставки.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка изменения статуса UT10_SetStatusPTU " + СокрЛП(ТекстОшибки));
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции
